#ifndef LED_H_20190115
#define LED_H_20190115

#include "stm32f10x.h"
/*********************************************************************
* 版权所有 (C)2018, 杭州数腾科技有限公司
* 
* 内容摘要：主要包含LED的初始化和驱动
* 当前版本：
* 作 者：henry
* 完成日期：2019年 月 日
*
* 修改记录1：修改历史记录，包括修改日期、修改者及修改内容
* 修改日期：
* 版 本 号：
* 修 改 人：
* 修改内容：
**********************************************************************/

/*led开关宏定义*/
#define LED_ON      0
#define LED_OFF     1

/*LED的种类*/
#define LED_RUN     0
#define LED_ERROR   1
#define LED_WORK    2

void led_init(void);


/**********************************************************************
* 功能描述： 对指定的LED控制
* 输入参数： led_kind:led的种类
*			 led_switch:开关量
* 输出参数： 
* 返 回 值：
*
* 修改日期 版本号 修改人 修改内容
* -----------------------------------------------
* 
***********************************************************************/
void led_SWITCH(u8 led_kind,     u8 led_switch);


#endif



